<a href="https://colab.research.google.com/github/caiocsvasconcelos/Curso_DataScience_Minsait/blob/Data_Science/Notebooks/Aula01/Pandas_Tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

In [ ]:
import numpy as np
import pandas as pd

a = np.array([1,2,3,4])
series = pd.Series([1,2,3,4])

print (series.describe(),'\n')  # Função não disponível no numpy

count    4.000000
mean     2.500000
std      1.290994
min      1.000000
25%      1.750000
50%      2.500000
75%      3.250000
max      4.000000
dtype: float64

In [ ]:
series

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
print (a[0],'\n')
print (a[:2],'\n')

1

[1 2]

In [ ]:
print (series[0],'\n')
print (series[:2],'\n')

1

0    1
1    2
dtype: int64

In [ ]:
series = pd.Series([1,2,3,4])
for d in series:
    print (d)

1
2
3
4

In [ ]:
print ('mean', a.mean())
print ('std',  a.std())
print ('max', a.max())

mean 2.5
std 1.118033988749895
max 4

In [ ]:
print ('mean', series.mean())
print ('std',  series.std())
print ('max', series.max())

mean 2.5
std 1.2909944487358056
max 4

In [ ]:
a = pd.Series([1, 2, 3, 4])
b = pd.Series([1, 2, 1, 2])

print (a + b)
print (a * 2)
print (a >= 3)
print (a[a >= 3])

0    2
1    4
2    4
3    6
dtype: int64
0    2
1    4
2    6
3    8
dtype: int64
0    False
1    False
2     True
3     True
dtype: bool
2    3
3    4
dtype: int64

In [ ]:
a = np.array([1, 2, 3, 4])
b = np.array([1, 2, 1, 2])

print (a + b)
print (a * 2)
print (a >= 3)
print (a[a >= 3])

[2 4 4 6]
[2 4 6 8]
[False False  True  True]
[3 4]

In [ ]:
population = pd.Series([1415045928,1354051854,326766748], index = ["China", "India", "US"])

print (population,'\n')
print ('Population of {} is {}'.format(population.index[1], population['India']))

China    1415045928
India    1354051854
US        326766748
dtype: int64

Population of India is 1354051854

In [ ]:
import numpy as np

population = np.array([1415045928,1354051854,326766748])
index = np.array(["China", "India", "US"])

print (population,'\n')
print ('Population of {} is {}'.format(index[1], population[1]))

[1415045928 1354051854  326766748]

Population of India is 1354051854

In [ ]:
# iloc and loc

import pandas as pd

population = pd.Series([1415045928,1354051854,326766748], index = ["China", "India", "US"])

print (population)

print (population[0])

China    1415045928
India    1354051854
US        326766748
dtype: int64
1415045928

In [ ]:
population.index

Index(['China', 'India', 'US'], dtype='object')

In [ ]:
population.values

array([1415045928, 1354051854,  326766748], dtype=int64)

In [ ]:
print (population.iloc[0]) # Acessando pelo número do índice

print (population.loc['China']) # Acessando pelo índice

1415045928
1415045928

In [ ]:
# Busca por um valor específico
print(population==1415045928,'\n')

China     True
India    False
US       False
dtype: bool

In [ ]:
value = population[population==1415045928]
value

China    1415045928
dtype: int64

In [ ]:
print(value.values)

[1415045928]

In [ ]:
population = [1415045928,1354051854,326766748]

for i in population:
    if i == 1415045928:
        value = population[population==1415045928]

print (value)

1415045928

In [ ]:
population = pd.Series([1415045928,1354051854,326766748], index = ["China", "India", "US"])

value = population[(population==1415045928)| (population==1354051854) ]

print (value)

China    1415045928
India    1354051854
dtype: int64

In [ ]:
population.values

array([1415045928, 1354051854,  326766748], dtype=int64)

In [ ]:
# Encontrando a população máxima

print ("Country Index with maximum population =",population.values.argmax())
print ("The max population is of country = {} and population ={}".format(population.values.argmax(),
                                                                         population.iloc[population.values.argmax()]))

Country Index with maximum population = 0
The max population is of country = 0 and population =1415045928

In [ ]:
population.index[population.values.argmax()]

'China'

In [ ]:
population.index[population.values.argmin()]

'US'

In [ ]:
# Adicinando, índices em ordem distinta
s1 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([100, 200, 300, 400], index=['b', 'd', 'a', 'c'])
print (s1 + s2)

a    301
b    102
c    403
d    204
dtype: int64

In [ ]:
# Indices sobrepostos
s1 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([100, 200, 300, 400], index=['c', 'd', 'e', 'f'])
print (s1 + s2)

a      NaN
b      NaN
c    103.0
d    204.0
e      NaN
f      NaN
dtype: float64

In [ ]:
# Usando fill_value
s1 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([10, 20, 30, 40], index=['a', 'b', 'g', 'h'])
result  =  s1.add(s2,fill_value=0)
print (result)

a    11.0
b    22.0
c     3.0
d     4.0
g    30.0
h    40.0
dtype: float64

In [ ]:
# Usando Pandas Apply
def make_capital(x):
    return x.capitalize()


s1 = pd.Series(['india', 'china', 'brazil'], index=['a', 'b', 'c'])
s2 = s1.apply(make_capital)

print (s2)

a     India
b     China
c    Brazil
dtype: object

In [ ]:
# Usando Lambda
s1 = pd.Series(['india', 'china', 'brazil'], index=['a', 'b', 'c'])
s2 = s1.apply(lambda x: x.capitalize())

print (s2)

a     India
b     China
c    Brazil
dtype: object

# Series vs Dataframe

![Captura%20de%20tela%20de%202022-06-28%2015-49-36.png](attachment:Captura%20de%20tela%20de%202022-06-28%2015-49-36.png)

In [ ]:
# Pandas DataFrame

import pandas as pd

country_df = pd.DataFrame({
    'country':['India','China', 'USA'],
    'population':[1415045928,1354051854,326766748],
    'population2':[1415045928,1354051854,326766748],
    'capital':['Delhi','Bejing','Washington']

})

print (country_df,'\n')

print (country_df.mean())

  country  population  population2     capital
0   India  1415045928   1415045928       Delhi
1   China  1354051854   1354051854      Bejing
2     USA   326766748    326766748  Washington

population     1.031955e+09
population2    1.031955e+09
dtype: float64

In [ ]:
country_df

  country  population  population2     capital
0   India  1415045928   1415045928       Delhi
1   China  1354051854   1354051854      Bejing
2     USA   326766748    326766748  Washington

In [ ]:
country_df.describe()

         population   population2
count  3.000000e+00  3.000000e+00
mean   1.031955e+09  1.031955e+09
std    6.114718e+08  6.114718e+08
min    3.267667e+08  3.267667e+08
25%    8.404093e+08  8.404093e+08
50%    1.354052e+09  1.354052e+09
75%    1.384549e+09  1.384549e+09
max    1.415046e+09  1.415046e+09

In [ ]:
country_df.set_index('country', inplace=True)
country_df

         population  population2     capital
country
India    1415045928   1415045928       Delhi
China    1354051854   1354051854      Bejing
USA       326766748    326766748  Washington

In [ ]:
country_df.reset_index(inplace=True)
country_df

  country  population  population2     capital
0   India  1415045928   1415045928       Delhi
1   China  1354051854   1354051854      Bejing
2     USA   326766748    326766748  Washington

In [ ]:
country_df.set_index('capital', inplace=True)
country_df

           country  population  population2
capital
Delhi        India  1415045928   1415045928
Bejing       China  1354051854   1354051854
Washington     USA   326766748    326766748

In [ ]:
# Pandas DataFrame

country_df = pd.DataFrame({
    'population':[1415045928,1354051854,326766748],
    'capital':['Delhi','Bejing','Washington'],
    'gdp':[2848231,14092514,20412870]

},
index = ['India','China', 'USA'],

)

country_df

       population     capital       gdp
India  1415045928       Delhi   2848231
China  1354051854      Bejing  14092514
USA     326766748  Washington  20412870

In [ ]:
country_df.loc['India']

population    1415045928
capital            Delhi
gdp              2848231
Name: India, dtype: object

In [ ]:
print (country_df.iloc[0])

population    1415045928
capital            Delhi
gdp              2848231
Name: India, dtype: object

In [ ]:
country_df.loc['India','gdp']

2848231

In [ ]:
country_df.iloc[0,1]

'Delhi'

In [ ]:
country_df.loc[ ['India','China'],:]

       population capital       gdp
India  1415045928   Delhi   2848231
China  1354051854  Bejing  14092514

In [ ]:
country_df['gdp']

India     2848231
China    14092514
USA      20412870
Name: gdp, dtype: int64

In [ ]:
# Acessando com range de valores

print (country_df.loc[:,['capital','gdp']] )  # selecionando 2 colunas
print()
print (country_df.iloc[:,[1,2]] )  # selecionando as mesmas 2 colunas usando iLoc

          capital       gdp
India       Delhi   2848231
China      Bejing  14092514
USA    Washington  20412870

          capital       gdp
India       Delhi   2848231
China      Bejing  14092514
USA    Washington  20412870

In [ ]:
country_df

       population     capital       gdp
India  1415045928       Delhi   2848231
China  1354051854      Bejing  14092514
USA     326766748  Washington  20412870

In [ ]:
gdp_df = country_df.loc[:,['gdp']]

print ("\n****The Country with maximum GDP  is ",gdp_df.idxmax())
print ("\n****The maximum GDP  is ",gdp_df.max())
print ("\n****The maximum GDP is ",gdp_df.max().values)

****The Country with maximum GDP  is  gdp    USA
dtype: object

****The maximum GDP  is  gdp    20412870
dtype: int64

****The maximum GDP is  [20412870]

In [ ]:
print (country_df[country_df['gdp'] == country_df['gdp'].max()])

print('*****************')
x = country_df[country_df['gdp'] == country_df['gdp'].max()]
print(x.index.values)

     population     capital       gdp
USA   326766748  Washington  20412870
*****************
['USA']

In [ ]:
raw_data = {'first_name': ['Jason', 'Molly', 'Pessoa1', 'Pessoa2', 'Pessoa3'],
        'country': ['USA', 'USA', 'France', 'UK', 'UK'],
        'age': [42, 52, 36, 24, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'country', 'age'])
df

  first_name country  age
0      Jason     USA   42
1      Molly     USA   52
2    Pessoa1  France   36
3    Pessoa2      UK   24
4    Pessoa3      UK   70

In [ ]:
# Variável booleana com filtro de país
american = df['country'] == "USA"
print(american)

# Variável booleana com filtro de idade
elderly = df['age'] > 50
print(elderly)

# Selecionando todos os casos cujos filtros sejam verdadeiros
df[american & elderly]

0     True
1     True
2    False
3    False
4    False
Name: country, dtype: bool
0    False
1     True
2    False
3    False
4     True
Name: age, dtype: bool

  first_name country  age
1      Molly     USA   52

### Operações matemáticas

In [ ]:
# Eixos Pandas
df = pd.DataFrame({'A': [0, 1, 2], 'B': [3, 4, 5]})

print (df,'\n')
print (df.sum(),'\n')
print (df.sum(axis=0),'\n') # soma as colunas
print (df.sum(axis=1),'\n') # soma as linhas

   A  B
0  0  3
1  1  4
2  2  5

A     3
B    12
dtype: int64

A     3
B    12
dtype: int64

0    3
1    5
2    7
dtype: int64

In [ ]:
df1 = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]})
df2 = pd.DataFrame({'a': [10, 20, 30], 'b': [40, 50, 60], 'c': [70, 80, 90]})
print (df1 + df2,'\n')

# Somando com overlap de colunas
df1 = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]})
df2 = pd.DataFrame({'d': [10, 20, 30], 'c': [40, 50, 60], 'b': [70, 80, 90]})
print (df1 + df2,'\n')

# Somando com overlap de índices de linhas
df1 = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]},
                   index=['row1', 'row2', 'row3'])
df2 = pd.DataFrame({'a': [10, 20, 30], 'b': [40, 50, 60], 'c': [70, 80, 90]},
                   index=['row4', 'row3', 'row2'])
print (df1 + df2,'\n')

    a   b   c
0  11  44  77
1  22  55  88
2  33  66  99

    a   b   c   d
0 NaN  74  47 NaN
1 NaN  85  58 NaN
2 NaN  96  69 NaN

         a     b     c
row1   NaN   NaN   NaN
row2  32.0  65.0  98.0
row3  23.0  56.0  89.0
row4   NaN   NaN   NaN

In [ ]:
#applymap() aplica a função a cada elemento do dataframe
df = pd.DataFrame({
    'a': [1, 2, 3],
    'b': [10, 20, 30],
    'c': [5, 10, 15]
})

def add_one(x):
    return x + 1

print (df.applymap(add_one))

   a   b   c
0  2  11   6
1  3  21  11
2  4  31  16

In [ ]:
df = pd.DataFrame({
    'a': [4, 5, 3, 1, 2],
    'b': [20, 10, 40, 50, 30],
    'c': [25, 20, 5, 15, 10]
})

print(df.apply(np.mean))
print(df.apply(np.max))

def second_largest(df):
    '''
    Fill in this function to return the second-largest value of each
    column of the input DataFrame.
    '''
    return df.nlargest(2).min() # Retorna as primeiras n linhas ordenadas por colunas em ordem decrescente.

a     3.0
b    30.0
c    15.0
dtype: float64
a     5
b    50
c    25
dtype: int64

In [ ]:
df

   a   b   c
0  4  20  25
1  5  10  20
2  3  40   5
3  1  50  15
4  2  30  10

In [ ]:
print (df.apply(second_largest))

a     4
b    40
c    20
dtype: int64

### Operações arquivos

In [ ]:
# Lendo CSV
df = pd.read_csv('https://raw.githubusercontent.com/datasciencemastery/pandas-numpy-tutorial/master/data_sheet.csv',sep = ',', error_bad_lines=False)
df

C:\Users\talmeidar\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3444: FutureWarning: The error_bad_lines argument has been deprecated and will be removed in a future version.


  exec(code_obj, self.user_global_ns, self.user_ns)

  itemcode           date  amount
0      MAG  01-April-2018    1000
1      MAG  02-April-2018     100
2      ALP  01-April-2018    1000
3      ALP  02-April-2018    1000

In [ ]:
df[df.itemcode=='MAG']

  itemcode           date  amount
0      MAG  01-April-2018    1000
1      MAG  02-April-2018     100

In [ ]:
((df.itemcode=='MAG')& (df.amount>100))

0     True
1    False
2    False
3    False
dtype: bool

In [ ]:
df[(df.itemcode=='MAG')& (df.amount>100)]

  itemcode           date  amount
0      MAG  01-April-2018    1000

In [ ]:
json_string = """
[
   {
      "Name":"Nik",
      "Age":33.0,
      "Sales":33.33
   },
   {
      "Name":"Kate",
      "Age":"None",
      "Sales":56.32
   },
   {
      "Name":"Isla",
      "Age":37.0,
      "Sales":43.44444
   }
]"""

In [ ]:
df_json = pd.read_json(json_string)
df_json

   Name   Age     Sales
0   Nik  33.0  33.33000
1  Kate  None  56.32000
2  Isla  37.0  43.44444

In [ ]:
df = pd.read_csv('../../Datasets/german_credit_data.csv')
df

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education
3,3,45,male,2,free,little,little,7882,42,furniture/equipment
4,4,53,male,2,free,little,little,4870,24,car
...,...,...,...,...,...,...,...,...,...,...
995,995,31,female,1,own,little,NaN,1736,12,furniture/equipment
996,996,40,male,3,own,little,little,3857,30,car
997,997,38,male,2,own,little,NaN,804,12,radio/TV
998,998,23,male,2,free,little,little,1845,45,radio/TV
999,999,27,male,2,own,moderate,moderate,4576,45,car

In [ ]:
df.drop(['Unnamed: 0'], axis=1, inplace=True)
df

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
1,22,female,2,own,little,moderate,5951,48,radio/TV
3,45,male,2,free,little,little,7882,42,furniture/equipment
4,53,male,2,free,little,little,4870,24,car
7,35,male,3,rent,little,moderate,6948,36,car
9,28,male,3,own,little,moderate,5234,30,car
...,...,...,...,...,...,...,...,...,...
989,48,male,1,own,little,moderate,1743,24,radio/TV
993,30,male,3,own,little,little,3959,36,furniture/equipment
996,40,male,3,own,little,little,3857,30,car
998,23,male,2,free,little,little,1845,45,radio/TV
999,27,male,2,own,moderate,moderate,4576,45,car

In [ ]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [ ]:
df['Sex'].value_counts()

male      690
female    310
Name: Sex, dtype: int64

In [ ]:
df.dtypes

Unnamed: 0           int64
Age                  int64
Sex                 object
Job                  int64
Housing             object
Saving accounts     object
Checking account    object
Credit amount        int64
Duration             int64
Purpose             object
dtype: object

In [ ]:
df.isnull().sum()

Unnamed: 0            0
Age                   0
Sex                   0
Job                   0
Housing               0
Saving accounts     183
Checking account    394
Credit amount         0
Duration              0
Purpose               0
dtype: int64

In [ ]:
df.isnull().sum().sum()

577

In [ ]:
df2 = df.replace(2, 5)
df2

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
1,22,female,5,own,little,moderate,5951,48,radio/TV
3,45,male,5,free,little,little,7882,42,furniture/equipment
4,53,male,5,free,little,little,4870,24,car
7,35,male,3,rent,little,moderate,6948,36,car
9,28,male,3,own,little,moderate,5234,30,car
...,...,...,...,...,...,...,...,...,...
989,48,male,1,own,little,moderate,1743,24,radio/TV
993,30,male,3,own,little,little,3959,36,furniture/equipment
996,40,male,3,own,little,little,3857,30,car
998,23,male,5,free,little,little,1845,45,radio/TV
999,27,male,5,own,moderate,moderate,4576,45,car

In [ ]:
filtro = df['Sex'] == 'female'
df2 = df[filtro]
df2

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
1,22,female,2,own,little,moderate,5951,48,radio/TV
10,25,female,2,rent,little,moderate,1295,12,car
11,24,female,2,rent,little,little,4308,48,business
12,22,female,2,own,little,moderate,1567,12,radio/TV
14,28,female,2,rent,little,little,1403,15,car
...,...,...,...,...,...,...,...,...,...
972,29,female,0,rent,little,little,1193,24,car
975,57,female,1,own,quite rich,rich,1258,24,radio/TV
976,64,female,2,own,little,moderate,753,6,radio/TV
982,28,female,3,own,moderate,rich,2923,21,car
985,25,female,2,rent,little,little,1433,15,furniture/equipment

In [ ]:
df.loc[filtro, 'Age']

1      22
10     25
11     24
12     22
14     28
       ..
972    29
975    57
976    64
982    28
985    25
Name: Age, Length: 168, dtype: int64

In [ ]:
df[df['Housing']=='rent']

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
7,35,male,3,rent,little,moderate,6948,36,car
10,25,female,2,rent,little,moderate,1295,12,car
11,24,female,2,rent,little,little,4308,48,business
14,28,female,2,rent,little,little,1403,15,car
21,44,male,2,rent,quite rich,little,2647,6,radio/TV
...,...,...,...,...,...,...,...,...,...
955,57,female,3,rent,rich,little,1231,24,radio/TV
972,29,female,0,rent,little,little,1193,24,car
973,36,male,2,rent,little,little,7297,60,business
979,25,male,2,rent,moderate,moderate,1264,15,car
985,25,female,2,rent,little,little,1433,15,furniture/equipment

In [ ]:
filtro = (df['Sex']=='female') & (df['Housing']=='rent')
df[filtro].head()

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
10,25,female,2,rent,little,moderate,1295,12,car
11,24,female,2,rent,little,little,4308,48,business
14,28,female,2,rent,little,little,1403,15,car
27,42,female,2,rent,rich,rich,409,12,radio/TV
47,23,female,0,rent,quite rich,little,1352,6,car

In [ ]:
df.loc[filtro, 'Job'].head()

10    2
11    2
14    2
27    2
47    0
Name: Job, dtype: int64

In [ ]:
credito_alto = df['Credit amount'] > 10000
df.loc[credito_alto, ['Job', 'Housing', 'Purpose']]

     Job Housing          Purpose
18     3    free              car
63     2     own         business
87     2    free        education
95     2    rent         business
105    3     own  vacation/others
205    3    free              car
226    2     own         radio/TV
274    1     own          repairs
285    1     own              car
374    3    free  vacation/others
378    3    free              car
381    3    free              car
395    2    rent        education
431    3     own  vacation/others
714    3     own              car
736    3    rent              car
818    3     own  vacation/others
832    2    rent         business
887    2     own         business
915    3     own  vacation/others
917    3     own              car
927    2    free              car

In [ ]:
df.groupby('Checking account')['Credit amount'].sum()

Checking account
little      761552
moderate    834906
rich        115047
Name: Credit amount, dtype: int64

In [ ]:
df['Checking account'].value_counts()

little      245
moderate    224
rich         53
Name: Checking account, dtype: int64

In [ ]:
df.groupby('Checking account')['Credit amount'].mean()

Checking account
little      3108.375510
moderate    3727.258929
rich        2170.698113
Name: Credit amount, dtype: float64

In [ ]:
df.groupby('Checking account')['Credit amount'].agg(['sum', 'mean'])

                     sum         mean
Checking account
little            761552  3108.375510
moderate          834906  3727.258929
rich              115047  2170.698113

In [ ]:
df_a = df[['Age', 'Sex']]
df_a

     Age     Sex
1     22  female
3     45    male
4     53    male
7     35    male
9     28    male
..   ...     ...
989   48    male
993   30    male
996   40    male
998   23    male
999   27    male

[522 rows x 2 columns]

In [ ]:
df_b = df[['Job', 'Saving accounts']]
df_b

     Job Saving accounts
1      2          little
3      2          little
4      2          little
7      3          little
9      3          little
..   ...             ...
989    1          little
993    3          little
996    3          little
998    2          little
999    2        moderate

[522 rows x 2 columns]

In [ ]:
pd.concat([df_a, df_b],axis=1)

     Age     Sex  Job Saving accounts
1     22  female    2          little
3     45    male    2          little
4     53    male    2          little
7     35    male    3          little
9     28    male    3          little
..   ...     ...  ...             ...
989   48    male    1          little
993   30    male    3          little
996   40    male    3          little
998   23    male    2          little
999   27    male    2        moderate

[522 rows x 4 columns]

### Exercício

1. Leitura da base de dados
2. Verificar quantas categorias existem nas variáveis e qual a quantidade de cada uma
3. Transformar as variáveis de texto em valores inteiros
4. Transformar o alvo Checking account
5. Fazer categorias das variáveis Saving Account

## Merge

In [ ]:
df1 = pd.DataFrame({'Paises': ['Br', 'Pt', 'Bo'], 'valor1':[1,2,3], 'valor2':[4,5,6]})
df2 = pd.DataFrame({'Paises': ['Br', 'Pt', 'Bo'], 'valor3':[1,2,3], 'valor4':[4,5,6]})

In [ ]:
pd.merge(df1,df2, on='Paises')

  Paises  valor1  valor2  valor3  valor4
0     Br       1       4       1       4
1     Pt       2       5       2       5
2     Bo       3       6       3       6

In [ ]:
idade = [18, 22, 40, 65, 100]
categorias = pd.cut(df['Age'], idade)
categorias

1      (18, 22]
3      (40, 65]
4      (40, 65]
7      (22, 40]
9      (22, 40]
         ...
989    (40, 65]
993    (22, 40]
996    (22, 40]
998    (22, 40]
999    (22, 40]
Name: Age, Length: 522, dtype: category
Categories (4, interval[int64, right]): [(18, 22] < (22, 40] < (40, 65] < (65, 100]]

In [ ]:
col = 'Age'
conditions = [
              ((18 < df[col]) & (df[col]<=22)),
              ((22 < df[col]) & (df[col]<=40)),
              ((40 < df[col]) & (df[col]<=65)),
              ((65 < df[col]) & (df[col]<=100))
             ]
choices = ["(18, 22]",'(22, 40]','(40, 65]', '(65, 100]']

categorias2 = pd.DataFrame(np.select(conditions, choices, default=np.nan))

In [ ]:
categorias.value_counts()

(22, 40]     348
(40, 65]     122
(18, 22]      39
(65, 100]     13
Name: Age, dtype: int64

In [ ]:
categorias2.value_counts()

(22, 40]     348
(40, 65]     122
(18, 22]      39
(65, 100]     13
dtype: int64

In [ ]:
df['Age'].min()

19

In [ ]:
conditions = [(18 < df['Age']) & (df['Age'] <= 22),
              (22 < df['Age']) & (df['Age'] <= 40),
              (40 < df['Age']) & (df['Age'] <= 65),
              (65 < df['Age']) & (df['Age'] <= 100)]

categories = ['18 a 22', '23 a 40', '41 a 65', '66 a 100']

df['Categorias'] = np.select(conditions, categories, default = 'Outra idade')
df

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose,Categorias
1,22,female,2,own,little,moderate,5951,48,radio/TV,18 a 22
3,45,male,2,free,little,little,7882,42,furniture/equipment,41 a 65
4,53,male,2,free,little,little,4870,24,car,41 a 65
7,35,male,3,rent,little,moderate,6948,36,car,23 a 40
9,28,male,3,own,little,moderate,5234,30,car,23 a 40
...,...,...,...,...,...,...,...,...,...,...
989,48,male,1,own,little,moderate,1743,24,radio/TV,41 a 65
993,30,male,3,own,little,little,3959,36,furniture/equipment,23 a 40
996,40,male,3,own,little,little,3857,30,car,23 a 40
998,23,male,2,free,little,little,1845,45,radio/TV,23 a 40
999,27,male,2,own,moderate,moderate,4576,45,car,23 a 40

In [ ]:
df['Categorias'].value_counts()

23 a 40     348
41 a 65     122
18 a 22      39
66 a 100     13
Name: Categorias, dtype: int64

In [ ]:
pd.cut(df['Age'], 3)

1      (18.944, 37.667]
3      (37.667, 56.333]
4      (37.667, 56.333]
7      (18.944, 37.667]
9      (18.944, 37.667]
             ...
989    (37.667, 56.333]
993    (18.944, 37.667]
996    (37.667, 56.333]
998    (18.944, 37.667]
999    (18.944, 37.667]
Name: Age, Length: 522, dtype: category
Categories (3, interval[float64, right]): [(18.944, 37.667] < (37.667, 56.333] < (56.333, 75.0]]

In [ ]:
categorias_q = pd.cut(df['Age'], 3, labels=['jovem', 'adulto', 'idoso'])
categorias_q.value_counts()

jovem     356
adulto    126
idoso      40
Name: Age, dtype: int64

In [ ]:
df['Duration'].apply(lambda x: x**2)

1      2304
3      1764
4       576
7      1296
9       900
       ...
989     576
993    1296
996     900
998    2025
999    2025
Name: Duration, Length: 522, dtype: int64

In [ ]:
df['Checking account'].apply(lambda x:0 if x == 'little' else 1)

1      1
3      0
4      0
7      1
9      1
      ..
989    1
993    0
996    0
998    0
999    1
Name: Checking account, Length: 522, dtype: int64

In [ ]:
df.to_csv('df_preprocessado.csv', index=False)

In [ ]:
df_desconfigurado = pd.read_csv('Aula01/dataset_desconfigurado.txt')

In [ ]:
df_desconfigurado

                      SITUACAO LOTE  DATA  NUMERO
0   =========== ======================= ==========...
1             1           1 202306         5223103928
2             0           2 202306         5223101250
3             0           3 202306         5223101961
4             0           3 202306         5223109972
5             0           5 202306         5223139983
6             0           4 202306         5223140082
7             0           2 202306         3101240247
8             1           3 202306         5223240269
9             1           1 202306         5223101240
10            0           7 202306         5221240357
11            0           9 202306         5223140379
12            1           6 202306         5201638722
13            0           5 202306         5223138733
14            1           6 202306         5221638854
15            0           7 202306         5223108876
16            0           8 202306         5221638920
17            0           1 202306         5223639063
18            1           1 202306         5223109107
19            0           2 202306         5223101649
20            0           3 202306         5223139371

In [ ]:
df_desconfigurado = pd.read_csv('Aula01/dataset_desconfigurado.txt', sep = ' ')

ParserError: Error tokenizing data. C error: Expected 10 fields in line 3, saw 22

In [ ]:
nome_das_colunas_do_arquivo = ['SITUACAO ', 'LOTE  ', 'DATA  ', 'NUMERO    ']
nome_das_colunas_do_arquivo

['SITUACAO ', 'LOTE  ', 'DATA  ', 'NUMERO    ']

In [ ]:
lista_de_larguras = [len(nome_das_colunas_do_arquivo[i]) for i in range(len(nome_das_colunas_do_arquivo))]
lista_de_larguras

[9, 6, 6, 10]

In [ ]:
df_desconfigurado = pd.read_fwf("Aula01/dataset_desconfigurado.txt", widths = lista_de_larguras)
df_desconfigurado

     SITUACAO    LOTE    DATA      NUMERO
0   =========  == ===  ======  ==========
1           1     1 2   02306          52
2           0     2 2   02306          52
3           0     3 2   02306          52
4           0     3 2   02306          52
5           0     5 2   02306          52
6           0     4 2   02306          52
7           0     2 2   02306          31
8           1     3 2   02306          52
9           1     1 2   02306          52
10          0     7 2   02306          52
11          0     9 2   02306          52
12          1     6 2   02306          52
13          0     5 2   02306          52
14          1     6 2   02306          52
15          0     7 2   02306          52
16          0     8 2   02306          52
17          0     1 2   02306          52
18          1     1 2   02306          52
19          0     2 2   02306          52
20          0     3 2   02306          52

In [ ]:
mask = (df_desconfigurado.iloc[:, 0].str.contains('='))
d1 = df_desconfigurado[~mask]
d1

   SITUACAO LOTE   DATA NUMERO
1         1  1 2  02306     52
2         0  2 2  02306     52
3         0  3 2  02306     52
4         0  3 2  02306     52
5         0  5 2  02306     52
6         0  4 2  02306     52
7         0  2 2  02306     31
8         1  3 2  02306     52
9         1  1 2  02306     52
10        0  7 2  02306     52
11        0  9 2  02306     52
12        1  6 2  02306     52
13        0  5 2  02306     52
14        1  6 2  02306     52
15        0  7 2  02306     52
16        0  8 2  02306     52
17        0  1 2  02306     52
18        1  1 2  02306     52
19        0  2 2  02306     52
20        0  3 2  02306     52